app/views/issues/_issue.html.haml

SELECT "issues".* FROM "issues" WHERE (completed_at IS NOT NULL)  ORDER BY completed_at DESC
---

.panel.panel-default.issue{ class: issue_class.join(' ') }
  .panel-body.issue-text