app/views/issues/_modal_complete_issue.haml


    = form_for Issue.new, url: issue_complete_url(Issue.first), method: :patch do |f|
      .modal-content
        .modal-header
---
SELECT  "issues".* FROM "issues"  ORDER BY "issues"."id" ASC LIMIT 1