app/views/issues/index.html.haml

SELECT "categories".* FROM "categories"  ORDER BY name ASC
---
      /   %label Category
      /   = f.select :category_id, options_from_collection_for_select(Category.order('name ASC'), :id, :name), { include_blank: false }, class: 'form-control'