app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "chip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "someone"], ["chip_id", "12345"], ["created_at", "2016-06-10 10:53:52.424143"], ["updated_at", "2016-06-10 10:53:52.424143"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Some Person"], ["updated_at", "2016-06-10 11:06:40.258122"], ["id", 7]]