app/views/admin/dashboard/show.html.haml

SELECT "users".* FROM "users"  ORDER BY name ASC
---
      %tbody
        - User.order('name ASC').each do |user|