app/controllers/comments_controller.rb

  def create
    c = Comment.new(comment_params)
    c.user = current_user
    c.issue_id = params[:issue_id]

    if c.text == ''
      redirect_to issue_path(c.issue), alert: "Error: Comment can't be empty.."
      return
    end

    if c.save
      flash[:new_comment_id] = c.id
      redirect_to issue_path(c.issue, anchor: c.anchor)
    else
      redirect_to issue_path(c.issue), anchor: c.anchor, alert: "Error: #{c.errors.full_messages.join(', ')}"
---
INSERT INTO "comments" ("text", "user_id", "issue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Hey, another comment"], ["user_id", 1], ["issue_id", 1], ["created_at", "2016-06-10 10:25:38.289496"], ["updated_at", "2016-06-10 10:25:38.289496"]]
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT 1  [["id", 1]]