app/controllers/issues_controller.rb

  def index
    @issue_filter_tabs = [
      ['All', nil, Issue.count],
      ['Open', 'open', Issue.incomplete.count],
      ['Closed', 'closed', Issue.completed.count]
    ]
---
SELECT "issues".* FROM "issues" WHERE (completed_at IS NOT NULL)  ORDER BY completed_at DESC
SELECT COUNT(*) FROM "issues" WHERE (completed_at IS NOT NULL)

  def create
    i = Issue.new(issue_params)
    i.user = current_user

    if i.save
---
INSERT INTO "issues" ("text", "location_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Woops"], ["location_id", 4], ["user_id", 1], ["created_at", "2016-06-09 18:50:41.159349"], ["updated_at", "2016-06-09 18:50:41.159349"]]

  def show
    @issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT 1  [["id", 1]]

  def complete
    i = Issue.find(params[:issue_id])
    i.completed_at = params[:issue][:completed_at]
    i.completed_by = current_user.id
    i.save!

    # create a comment logging the completion of this issue
    Comment.create!(user: current_user, issue: i, type: :completed, text: params[:complete_comment] || '')
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "issues" SET "completed_at" = $1, "completed_by" = $2, "updated_at" = $3 WHERE "issues"."id" = $4  [["completed_at", "2016-06-09 18:50:45.000000"], ["completed_by", 1], ["updated_at", "2016-06-09 18:50:52.124504"], ["id", 3]]
INSERT INTO "comments" ("user_id", "issue_id", "type", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["issue_id", 3], ["type", 1], ["text", ""], ["created_at", "2016-06-09 18:50:52.150577"], ["updated_at", "2016-06-09 18:50:52.150577"]]