app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."chip_id" = ? LIMIT 1  [["chip_id", "a"]]
---
  def create
    user = User.find_by_chip_id(params[:chip_id])